local privacyStr =[[
# <appname>隐私权政策

<appname>隐私权政策（以下简称“本政策”）仅适用于深圳市帕拉卡科技有限公司（以下简称“我们”或“帕拉卡”）的<appname>产品（PC端、移动端）或服务。
我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺，我们将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
请在使用我们的产品（或服务）前，仔细阅读并了解本政策，并确认了解我们对您个人信息的处理规则。一旦您点击确认接受本政策或在本政策更新后，您继续使用本软件，即表示您认可并接受本政策（含更新版本）的所有内容，并同意我们按本政策收集、使用、保存、共享、转让或披露您的相关个人信息。

**本政策将帮助您了解以下内容：**

```javascript
一、定义与解释
二、我们如何收集和使用您的个人信息
三、我们如何使用Cookie和同类技术
四、我们如何共享、转让、公开披露您的个人信息
五、我们如何存储和保护您的个人信息
六、您的权利
七、我们如何处理未成年人的个人信息
八、您的个人信息如何在全球范围转移
九、我们如何更新本政策
十、如何联系我们
```

本隐私政策发布日期：2024年11月15日

生效日期：2024年11月15日

### 一、定义与解释

  1.个人信息
  个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别自然人**个人身份的各种信息，包括但不限于自然人的姓名、出生日期、身份证件号码、个人生物识别信息、住址、电话号码。为免疑义，个人信息包括但不限于个人敏感信息。**
  2.个人敏感信息
  个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇的个人信息。**个人敏感信息包括但不限于身份证件号码、个人生物识别信息、银行账号、通信内容、健康生理信息。**
  3.必要个人信息
  指保障<appname>产品或服务基本功能服务正常运行所必需的个人信息，缺少该信息<appname>产品或服务即无法实现基本功能服务。
  4.个人信息主体
  个人信息主体指个人信息所标识的自然人。
  5.去标识化
  去标识化指通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。
  6.匿名化
  匿名化指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。
  7.设备
  **设备**是指可用于访问我们产品或服务的装置，例如台式计算机、笔记本电脑、平板电脑或智能手机。
  8.唯一设备标识符
  **唯一设备标识符（专属 ID 或 UUID）是指由设备制造商编入到设备中的一串字符，可用于以独有方式标识相应设备（移动设备的 IMEI 号）。唯一设备标识符**有多种用途，包括可在不能使用cookies时用以提供广告。
  9.IP地址
  每台上网的设备都会指定一个编号，称为**互联网协议 (IP) 地址**。这些编号通常都是根据地理区域指定的。**IP 地址**通常可用于识别设备连接至互联网时所在的位置。
  10.MAC地址
  **MAC地址**用于在网络中唯一标示一个网卡，一台设备若有一或多个网卡，则每个网卡都需要并会有一个唯一的**MAC地址** 。
  11.Android ID
  在Android系统中，每个Android设备都有一个唯一的标示符，即**设备ID**。这个ID在应用程序开发中也被称为**Android ID，设备ID，系统ID**等等，是一个可以用于标识Android设备的字符串。
  12.关联公司
  指任何直接或间接控制帕拉卡、受帕拉卡控制或与帕拉卡受共同控制的任何一方。此处的“控制”和“受控制”分别指通过投票权、合同或其他方式而督导某一方的管理政策的权利。

### 二、我们如何收集和使用您的个人信息

  1、成为我们的用户并登录
  本产品支持您使用手机号自行完成注册，成为我们的用户。您在注册账户或者使用我们的产品或服务时，在经您的同意和确认后，我们会收集您所提供的相关个人信息，**包括您的名称、手机号、登陆密码、您的学段、年级、您所在的省市以及您的头像**。如果您提供额外信息补全个人资料，将有助于我们给您提供更好的服务和体验。您提供的上述信息将在您使用我们的服务期间持续授权使用。在您主动注销帐号时，我们将根据适用法律法规的要求尽快使其去标识化或删除您的个人信息。
  2、为您提供我们的产品和服务
  为了给您提供更好的产品及服务，我们根据合法、正当、必要的原则，出于如下所述的目的收集和使用您的个人信息：

- 您通过参加我们举办的活动时所主动提交的信息
  如果您参与我们的线上活动，填写的调查问卷中可能包含您的**姓名、电话、电子邮箱、家庭地址信息**。
- 您通过其他方式向我们所主动提交的信息
  如果您通过邮寄或传真方式或与客服联系等其他方式向我们提供相关的证明文件，文件中可能包含您的姓名、电话、家庭地址等信息。
- 设备信息
  我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息，包括设**备名称、设备型号、操作系统和应用程序版本、设备设置、电池、信号强度，语言设置、分辨率、设备传感器参数、服务提供商网络ID。**
- 服务日志信息
  当您使用我们的所有业务功能时，系统会通过cookies或其他方式自动收集某些信息作为有关网络日志保存。此类信息包括：使用本产品或服务时的详细使用情况，例如**您的搜索查询内容、访问的页面地址、浏览器的类型、运营商、使用的语言、访问日期和时间、设备崩溃、系统活动、访问的网页记录以及用户触发事件统计数据等**。该类数据都是匿名的，我们无法根据上传数据定位到具体用户。
- 软件或其他相关信息
  为了帮助您更好地使用<appname>的产品或服务，<appname>产品或服务可能会通过SDK等收集相关信息。您用于接入<appname>产品或服务的其他程序所提供的配置信息、移动设备所用的版本，<appname>产品或服务可能对MAC地址可以用于识别终端设备的信息进行加密，从而提高对隐私的保护。
  请注意，单独的设备信息、日志信息等是无法识别特定自然人身份的信息。如果<appname>产品或服务将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，会将该类个人信息做匿名化、去标识化处理。
- 系统权限调用
  我们为提供更优质的服务，会调用您的一些系统权限。下方我们列出了请求权限对应的业务功能、调用目的及请求时机。其中的所有权限，您都可以在系统的设置功能中选择关闭，关闭后我们将无法通过这些权限收集对应的个人信息。对于系统权限的具体操作方式，以您的设备系统开发者提供的说明为准。
  <appname>移动端APP
  系统权限	对应业务功能	调用权限目的	请求权限时机
  存储	应用启动	应用正常启动需要占用存储空间	首次打开<appname>移动端APP时弹窗询问
  网络	获取试题列表、作业练习、同步个人数据、更新应用配置	用于网络下载或同步应用数据、更新应用配置	首次进行网络连接时弹窗询问
  麦克风	完成听说类试题	用于进行语音输入	首次使用语音功能时弹窗询问
  相机	拍照作答、上传头像	打开摄像头进行拍照	首次使用需要拍照的相应功能时弹窗询问
  相册	拍照作答、上传头像	打开相册选择图片	首次使用需要拍照的相应功能时弹窗询问
  下载	试题资源下载	下载应用内的学习资源	首次使用下载功能时弹窗询问
  通知	推送活动通知	用于向用户推送精品资源或重要通知	首次打开<appname>移动端APP时询问
  护眼模式	开启护眼模式	用于开启护眼模式	首次使用护眼模式时弹窗询问
  位置信息权限	选择地区课程	帮助用户选择默认的地区课程	首次使用需要位置信息的相应功能弹窗询问

 3、持续开发和优化产品服务
  为迭代和开发新的产品和服务，我们可能对收集的信息加以统计分析辅助决策，但形成的数据分析结果不包含您的任何身份识别信息。例如我们在提供某些功能或服务中邀请用户参与“用户体验改进计划”，加入用户体验改进计划的用户，我们会根据需要对产品或服务的各项功能使用情况进行统计，这样可以通过分析统计数据提高产品或服务质量，推出对用户有帮助的创新产品或服务提升。如您不想参与该计划，可以选择不参与相关计划、关闭相关产品/服务中的相关功能。
  4、为您提供安全保障服务
  我们会将您的信息用于身份验证、安全防范、反诈骗监测、存档备份、客户的安全服务用途，以提高产品和服务的安全性。当我们的系统发生故障时，我们会记录和分析系统故障时产生的信息，优化相关服务。您下载或安装的安全软件会对恶意程序或病毒进行检测，为您识别诈骗信息。
  5、第三方SDK收集信息的情形
  我们的部分业务服务或功能，需要使用第三方SDK来协助完成，或者由第三方SDK来直接提供相关服务。SDK技术服务提供方会基于向您提供功能或服务之必须获取相应权限及信息，请您详细阅读我们下述SDK列表了解我们具体集成的SDK名称、SDK技术服务提供方、SDK应用场景（即SDK类型）及SDK获取的权限与个人信息类型等内容。
  6、事先征得授权同意的例外
  根据相关法律法规及国家标准，在以下情形中，我们会依法收集并使用您的个人信息无需征得您的同意:
  （1）与国家安全、国防安全直接相关的；
  （2）与公共安全、公共卫生、重大公共利益直接相关的；
  （3）与犯罪侦查、起诉、审判和判决执行等直接相关的；
  （4）出于维护您或他人的生命、财产等重大合法权益但又很难得到您本人同意的；
  （5）所收集的个人信息是您自行向社会公众公开的；
  （6）从合法公开披露的信息中收集个人信息，例如：合法的新闻报道、政府信息公开等渠道；
  （7）根据您的要求签订和履行合同所必需的；
  （8）用于维护所提供的服务的安全稳定运行所必需的，例如：发现、处置产品或服务的故障；
  （9）法律法规规定的其他情形。
  7、补充说明：
  当我们要将信息用于本政策未载明的其它用途时，会事先征求您的同意。
  当我们要将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。

### 三、我们如何使用Cookie和同类技术

1. Cookie
  为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储您的偏好或未提交的练习进度等数据。
  我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。有关详情，请参见 AboutCookies.org。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止 Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。
2. 网站信标和像素标签
  除 Cookie 外，我们还可能会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击 URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。

### 四、我们如何对外共享、转让、披露使用您的个人信息

1. 信息的共享
我们不会与提供<appname>产品或服务以外的公司、组织和个人共享您的个人信息，但以下情况除外：
· 事先获得您明确的同意或授权；
· 根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况下共享；
· 与我们的其他产品或服务共享或与我们的关联公司共享，您的个人信息可能会与我们的关联公司共享。我们只会共享必要个人信息，且受本隐私政策中所声明目的的约束。关联公司如要改变个人信息的使用及处理目的，将再次征求您的同意。
· 与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由我们和授权合作伙伴共同提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所需的必要个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。目前，我们的授权合作伙伴包括以下类型：
（1）广告、分析服务类的授权合作伙伴。除非得到您的许可，否则我们不会将您的个人身份信息（指可以识别您身份的信息，例如**姓名或电子邮箱**，通过这些信息可以联系到您或识别您的身份）与提供广告、分析服务的合作伙伴分享。我们会向这些合作伙伴提供有关其广告覆盖面和有效性的信息，而不会提供您的个人身份信息，或者我们将这些信息进行汇总，以便它不会识别您个人。
（2）供应商、服务提供商和其他合作伙伴。我们将信息发送在全球范围内给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供技术基础设施服务、分析我们服务的使用方式、衡量广告和服务的有效性、提供客户服务或进行学术研究和调查。
对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施，以不低于本政策声明的保护程度来处理、保护您的个人信息。
2. 信息的转让
我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
1)   在获取明确同意的情况下转让：获得您的明确同意后，在授权范围内，我们会向指定其他方转让您的个人信息；
2)   我们发生收购、兼并、重组等导致主体变更时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织重新向您征求授权同意；
3）根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必需的情况下进行转让。
3. 信息的披露
我们仅会在以下情况下，公开披露您的个人信息：
1)   获得您明确同意后，我们可能会公开披露您所指定的个人信息；
2)   基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息。
4. 共享、转让、公开披露个人信息的例外
以下情形中，我们可以共享、转让、公开披露您的个人信息无需事先征得您的授权同意。
（1）与我们履行法律法规规定的义务相关的；
（2）与国家安全、国防安全直接相关的；
（3）与公共安全、公共卫生、重大公共利益直接相关的；
（4）与刑事侦查、起诉、审判和判决执行等直接相关的；
（5）出于维护您或其他个人生命、财产等重大合法权益但又很难得到本人同意的；
（6）您自行向社会公众公开的个人信息；
（7）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
（8）为订立或者履行您与我们签署的合同所必需。

### 五、我们如何存储和保护您的个人信息

1. 我们如何存储信息
1)   存储信息的地点
我们遵守法律法规的规定，收集的有关您的信息和资料将保存在中华人民共和国境内我们的服务器上。以下情形除外：
· 法律法规有明确规定；
· 获得您的明确授权；
· 您通过互联网进行跨境交易等个人主动行为。
2)   存储信息的期限
一般而言，我们仅为实现目的所必需的最短时间保留您的个人信息。用于识别您个人身份以及反映相关活动的个人信息将留存至用户注销帐号时，除非法律要求或允许在更长的期间内保留这些信息。但在下列情况下，我们因需符合法律要求，更改个人信息的存储时间：
· 为遵守适用的法律法规等有关规定；
· 为遵守法院判决、裁定或其他法律程序的规定；
· 为遵守相关政府机关或法定授权组织的要求；
· 我们有理由确信需要遵守法律法规等有关规定；
· 为执行相关服务协议或本政策、维护社会公共利益，为保护我们的客户、我们的产品、其他用户或雇员的人身财产安全或其他合法权益所合理必需的用途。
在您终止使用我们的产品后，我们会停止对您的信息的收集和使用，法律法规或监管部门另有规定的除外。
当我们的相关服务发生停止运营的情形时，我们将采取包括推送通知和公告形式在内的通知您，并在合理的期限内删除服务器中留存的您的个人信息或进行匿名化处理。
2. 我们如何保护您的个人信息
（1）个人信息保护
我们非常重视您的隐私及个人信息保护，也会采取合理的措施保护您的个人信息。除法律法规规定或本政策另有约定的情形外，未经用户许可我们不会向第三方公开、透露用户个人信息，并会对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。
（2）数据安全措施
我们会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改，避免数据的损坏或丢失。例如，我们的网络服务采取了传输层安全协议等加密技术，通过https等方式提供浏览服务，确保用户数据在传输过程中的安全；我们采取加密技术（TLS、SSL）、匿名化处理和保护机制对用户个人信息进行加密保存，并通过隔离技术进行隔离；我们通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用；我们通过信息接触者保密协议等方式，仅允许有必要知晓这些信息的产品及产品关联方的员工、合作伙伴访问个人信息，并为此设置了严格的访问权限控制和监控机制，同时要求接触到您个人信息的所有人员履行相应的保密义务。如果未能履行这些义务，会被追究法律责任或被中止与我们的合作关系；我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的帐号安全。
我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。

### 六、您的权利

按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利，您可以参考下面的步骤进行相关操作：

1. 访问您的个人信息
您可以通过以下步骤访问头像、姓名、学校、班级等基本信息：
1）进入<appname>，在左上角找到“个人头像”，点击打开“个人信息”；
2）查看个人基础信息；
3）点击“查看更多”，获得更多的扩展资料。
2. 更改您的个人信息
您可以通过以下步骤更正您的头像、姓名、学校、班级等基本信息：
1）进入<appname>，在左上角找到“个人头像”，点击打开“个人信息”；
2）查看个人基础信息进行修改；
3）点击“查看更多”，对更多扩展资料进行修改。
3. 改变您授权同意的范围或撤回您的授权
您可以通过删除信息、关闭设备功能、在网站或软件中进行隐私设置等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。 每个业务功能需要一些必要个人信息才能得以完成。对于额外收集的个人信息的收集和使用，您可以随时给予或收回您的授权同意。当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。
4. 注销帐号
您可以通过如下方式注销帐号：
1）进入<appname>，在左上角找到“个人头像”，点击打开“个人信息”；
2）点击“查看更多”，在界面中找到“注销账号”按钮。
3）点击“注销账号”按钮后，跟随提示进行。
您注销帐号后，我们将停止为您提供依赖帐号登录的产品和服务，并依据您的要求，除法律法规另有规定外，我们将删除或匿名化处理您的个人信息，诸如练习报告等重要数据无法恢复，即使重新创建帐号也无法恢复旧帐号数据。
5. 响应您的上述请求
我们将采取适当的技术手段，保证您对于自己的个人资料可进行查询、补充、更正或删除，或通过相关产品或服务发布的反馈或投诉渠道申请我们对相关信息进行补充、更正或删除；我们收到您的申请后将按流程予以处理，为保障安全，按照流程，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在15个工作日内做出答复，对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
如果您无法访问、更正或删除您的个人信息，或您需要访问、更正或删除您在使用我们的产品时所产生的其他个人信息，或您认为我们存在任何违反法律法规或与您关于个人信息的收集或使用的约定，您可通过我们对外公布的相关产品或服务的官方反馈渠道与我们联系。
在以下情形中，我们将无法响应您的请求：
1）与国家安全、国防安全直接相关的；
2）与公共安全、公共卫生、重大公共利益直接相关的；
3）与犯罪侦查、起诉、审判和执行判决等直接相关的；
4）我们有充分证据表明您存在主观恶意或滥用权利的；
5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
6）涉及商业秘密的。

### 七、我们如何处理未成年人的个人信息

我们非常重视对未成年人的个人信息保护。我们根据国家相关法律法规的规定保护未成年人的个人信息。如果没有家长或法定监护人的同意，未成年人不得创建自己的用户帐号。如您为未成年人，请在父母或监护人的陪同和帮助下仔细阅读本隐私权政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。对于经父母或法定监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许、家长或法定监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。
如果我们发现自己在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。

### 八、您的个人信息如何在全球范围转移

原则上，我们在中华人民共和国境内收集产生的个人信息，存储在中华人民共和国境内。
由于我们通过遍布全球的资源和服务器提供产品或服务，这意味着，在获得您的授权同意后，您的个人信息可能会被转移到您使用产品或服务所在国家/地区的境外管辖区，或者受到来自这些管辖区的访问。
此类管辖区可能设有不同的数据保护法，甚至未设立相关法律。在此类情况下，我们会确保您的个人信息得到在中华人民共和国境内足够同等的保护。例如，我们会请求您对跨境转移个人信息的同意，或者在跨境数据转移之前实施数据去标识化等安全举措。

### 九、我们如何更新本隐私权政策

（1）我们的隐私权政策可能变更。
· 为给您提供给更好的服务，我们的产品或服务将不时更新与变化，也会适时对本政策进行修订，这些修订构成本政策的一部分。
· 未经您明确同意，我们不会削减您按照本隐私权政策所应享有的权利。我们会在专门页面上发布对隐私权政策所做的任何变更。同时我们会将本政策的旧版本存档，供您查阅。
（2）对于重大变更，我们还会提供更为显著的通知，包括通过网站公示的方式进行通知甚至向您提供弹窗提示。如果您不同意本政策，或对本则修改、更新的内容有异议，您可以选择停止使用<appname>产品或服务与/或注销帐号。但请您知悉，您帐号注销之前、停止使用本服务之前的行为和活动仍受本政策的月数。
本政策所指的重大变更包括但不限于：
· 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
· 我们在控制权等方面发生重大变化。如并购重组等引起的所有者变更等；
· 个人信息共享、转让或公开披露的主要对象发生变化；
· 您参与个人信息处理方面的权利及其行使方式发生重大变化；
· 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
· 个人信息安全影响评估报告表明存在高风险时；
· 伴随政策或法律发布实施，为响应国家政策或者法律规范，做出变更。

### 十、如何联系我们

如您在使用我们的产品的过程中对本隐私政策有任何疑问或建议，请通过以下联系方式与我们联系：

```javascript
公司地址：深圳市南山区国际创新谷一期1栋A座1701-1702
电 话：0755-86233932
邮箱：support@paraengine.com
```

为保障我们高效处理您的问题并及时向您反馈，需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份后处理您的请求。一般情况下，我们将在15个工作日内回复。
如果您对我们的回复不满意，特别是您认为我们的个人信息处理行为损害了您的合法权益，您还可以向 【帕拉卡住所地有管辖权的法院提起诉讼】。
]]


local licenseStr = [[
# 用户许可协议
### 1.特别提示
  1.1 深圳市帕拉卡科技有限公司（称为运营主体）同意按照本协议的规定及其不时发布的操作规则提供帕拉卡（Paracraft）产品及网络服务（以下称“帕拉卡（Paracraft）产品服务”），为获得帕拉卡（Paracraft）产品服务，服务使用人（以下称“用户”或“您”）应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中点击“同意”按钮即表示用户已完全理解并接受本协议项下的全部条款，用户涉及帕拉卡（Paracraft）产品服务的所有行为应当受本协议的约束。
  1.2 用户注册成功后，运营主体将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。
  1.3 用户注册成功后，在使用帕拉卡（Paracraft）产品及其相关网络服务的过程中，运营主体公司有权基于用户的操作行为进行非商业性的调查研究。
  1.4 本协议存在免除或限制责任、对用户权利进行限制等涉及用户利益的重要条款均困又以黑体加粗、下划线或其他合理方式提请用户注意并重点阅读。
  1.5 如您在18周岁以下，您只能在父母或监护人的监护参与下才能注册获得帕拉卡（Paracraft）产品服务，您与您的父母或监护人应特别注意有关未成年人的条款。
  
### 2.服务说明
  2.1 帕拉卡（Paracraft）产品服务的具体内容由运营主体根据实际情况提供。
  2.2 用户理解，运营主体仅提供软件及网络服务，除此之外均应由用户自行负担。 
  
### 3. 服务变更、中断或终止
  3.1 鉴于网络服务的特殊性，用户同意运营主体有权随时变更、中断或终止部分或全部的网络服务。变更、中断或终止网络服务时，运营主体无需通知用户，也无需对任何用户或任何第三方承担任何责任。
  3.2 用户理解，运营主体需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，运营主体无需为此承担任何责任，但运营主体应尽可能事先进行通告。
  3.3 如发生下列任何一种情形，运营主体有权不经事先通知随时中断或终止向用户提供本协议项下的网络服务而无需对用户或任何第三方承担任何责任：
  3.3.1 用户提供的个人资料、身份信息不真实；
  3.3.2 用户违反本协议中规定的使用规则；
  3.3.3 用户利用帕拉卡（Paracraft）产品服务制作、或在运营主体网站或帕拉卡（Paracraft）产品服务的任何页面上传、发布、转载、传送含有下列内容之一的信息：
  （1）违反国家法律法规禁止性规定的；
  （2）危害国家安全、泄露国家机密，散布谣言、扰乱社会秩序、破坏社会稳定的；
  （3）破坏民族团结，违反国家宗教政策、宣扬邪教或封建迷信的；
  （4）散布淫秽、色情、赌博、暴力、恐怖或教唆犯罪的；
  （5）侮辱、诽谤、恐吓他人，侵害他人隐私、名誉、知识产权及其他合法权益的；
  （6）其他违背社会公共利益或公共道德或依据帕拉卡（Paracraft）产品网络服务相关协议与规则认定为不适合发布的。
  3.4 如用户注册的帕拉卡（Paracraft）产品服务帐号在任何连续90日内未实际使用，则运营主体有权删除该帐号并停止为该用户提供相关的网络服务。
  3.5 用户注册的帕拉卡（Paracraft）产品服务帐号昵称如存在违反法律法规或国家政策要求，或侵犯任何第三方合法权益的情况，运营主体有权收回该账号昵称。
  
### 4. 使用规则
  4.1 用户在申请注册帕拉卡（Paracraft）产品服务账号时，必须向运营主体提供真实、准确的个人资料及身份信息。如因用户填写的信息失实而产生相应的后果，将由用户自行承担，运营主体不承担任何责任。
  4.2 用户不应以任何形式将其帐号或密码授权、转让或出借予他人使用，否则用户应承担由此产生的全部责任。如因用户主动泄露或因用户的保管疏忽导致帐号、密码失窃，使帐号被非法使用的，由用户本人承担由此产生的全部责任，运营主体不承担责任。
  4.3 用户有义务保证帐号和密码的安全，用户利用该帐号和密码所进行的一切活动引起的任何损失或损害，由用户自行承担全部责任，运营主体不承担任何责任。
  4.4 对于用户通过帕拉卡（Paracraft）产品服务上传到运营主体网站上可公开获取区域的任何内容，用户同意运营主体在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。
  4.5 用户在使用运营主体提供的产品服务过程中，必须遵循以下原则：
  4.5.1 遵守中国有关的法律和法规；
  4.5.2 遵守所有与网络服务有关的网络协议、规定和程序；
  4.5.3 不得为任何非法目的而使用网络服务系统；
  4.5.4 不得以任何形式使用运营主体网络服务侵犯运营主体的商业利益；
  4.5.5 不得利用帕拉卡（Paracraft）产品服务进行任何可能对互联网或移动网正常运转造成不利影响的行为；
  4.5.6 不得利用运营主体提供的帕拉卡（Paracraft）产品服务制作、上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
  4.5.7 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；
  4.5.8 不得利用运营主体网络服务系统进行任何不利于运营主体的行为。
  4.6 除非法律允许及运营主体书面许可，用户使用帕拉卡（Paracraft）产品服务的过程中不得从事下列行为：
  4.6.1 删除帕拉卡（Paracraft）产品及其副本上关于著作权的信息。
  4.6.2 对帕拉卡（Paracraft）产品进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现帕拉卡（Paracraft）产品的源代码。
  4.6.3 对帕拉卡（Paracraft）产品服务拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等。
  4.6.4 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的。
  4.6.5 行或者授权他人、第三方软件对帕拉卡（Paracraft）产品及其组件、模块、数据进行干扰。
  4.6.6 用户通过使用帕拉卡（Paracraft）产品服务的过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、作品等注册信息及制作内容，或文字、语音、图片、视频等发送、传递相关页面，以及其他使用账号产生的内容，不得违反国家相关国家法律制度，包含但不限于如下原则：
  （1）违反宪法所确定的基本原则；
  （2）危害国家安全，泄露国家秘密，破坏国家统一的；
  （3）损害国家荣誉和利益的；
  （4）煽动民族仇恨、民族歧视的；
  （5）破坏国家宗教政策，宣扬邪教和封建迷信的；
  （6）散布谣言，扰乱社会秩序，破坏社会稳定的；
  （7）侮辱或者诽谤他人的；
  （8）含有法律、行政法规禁止的其他内容的。
  4.6.7 其他未经运营主体在提供帕拉卡（Paracraft）产品服务时明示授权的行为。
  4.7 运营主体有权对用户使用帕拉卡（Paracraft）产品服务的情况进行审查和监督(包括但不限于对用户存储在运营主体的内容进行审核)。
  4.8 运营主体针对某些特定的由运营主体提供的网络服务的使用通过各种方式（包括但不限于网页公告、电子邮件、短信提醒等）作出的任何声明、通知、警示等内容视为本协议的一部分，用户如继续使用该等运营主体网络服务，视为用户同意该等声明、通知、警示的内容。

### 5. 知识产权
   5.1 帕拉卡（Paracraft）产品服务所涉及的所有相关网站、软件、开发者服务、社区和网站内容（该术语在网站和社区附加条款中定义）均受中国和外国的版权、商标和其他法律保护。除非协议中明确规定，否则运营主体及其许可方独家拥有该帕拉卡（Paracraft）产品服务的所有权利、所有权和利益，包括所有相关的知识产权。您不会删除、更改或掩盖服务中包含或随附的任何版权、商标、服务标记或其他所有权声明。
   5.2 数据许可
  5.2.1 用户在使用帕拉卡（Paracraft）产品服务时制作、上传、发布、传送的内容的知识产权归用户或其权利人所有，相关责任由其承担。
  5.2.2 前述的用户制作、上传、发布、传送行为均视为对运营主体的授权，即用户将其制作、上传、发布、传送的内容 永久、不可撤销、非独占性且免版税的许可授权给运营主体在全球范围内使用、复制、传播、修改、汇编、改编、再许可、翻译、创建衍生作品、出版、表演及展示此等内容。
  5.2.3 用户同意授权运营主体收集、访问、处理、传输、存储、复制、共享、显示和使用 帕拉卡（Paracraft）产品服务 收集的或您提供的与您相关的任何数据和信息使用服务，以用于提供、运营、开发、改进和/或优化我们的任何服务，以及我们的隐私政策允许的其他方式。
   5.3 知识产权声明
  5.3.1 运营主体网站及帕拉卡（Paracraft）产品服务使用的 帕拉卡（Paracraft） 的所有商标、服务标记、徽标、商品名称和任何其他专有名称均为 帕拉卡（Paracraft） 的商标或注册商标。任何其他商标、服务标记、徽标、商品名称和任何其他专有名称均为其各自各方的商标或注册商标。
  5.3.2 除另有特别权利声明外，运营主体网站和运营公司提供的产品或服务中出现的内容（包括但不限于文字、图片、图表、音频、视频、代码等）的知识产权均归运营主体享有，未经运营主体许可，不得出于商业或不正当目的以任何形式转载或使用。
  
### 6. 隐私保护
  6.1 保护用户隐私是运营主体的一项基本政策，运营主体保证不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在运营主体的非公开内容，但下列情况除外：
  6.1.1 事先获得用户的明确授权；
  6.1.2 根据有关的法律法规要求；
  6.1.3 按照相关政府主管部门的要求；
  6.1.4 按照检察院、法院等司法机关的要求；
  6.1.5 为维护社会公众的利益；
  6.1.6 为维护运营主体的合法权益；
  6.1.7 用户出现违法中国有关法律、法规、规章、政策的，确有需要的情况下。
  6.2 运营主体可能会与第三方合作向用户提供相关的产品及网络服务，在此情况下，如该第三方同意承担与运营主体同等的保护用户隐私的责任，则运营主体有权将用户的注册资料等提供给该第三方。
  6.3 在不透露单个用户隐私资料的前提下，运营主体有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
  
### 7. 免责声明
  7.1 用户明确同意其使用运营主体帕拉卡（Paracraft）产品服务所存在的风险及一切后果将完全由用户本人承担，运营主体对此不承担任何责任。
  7.2 运营主体不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
  7.3 运营主体不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由运营主体实际控制的任何网页上的内容，运营主体不承担任何责任。
  7.4 对于因不可抗力或运营主体不能控制的原因造成的网络服务中断或其它缺陷，运营主体不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
  7.5 用户停止使用帕拉卡（Paracraft）产品服务或服务被中止或取消的，运营主体有权从服务器永久地删除该数据且没有返还义务。
  7.6 帕拉卡产品服务所提供的部分内容仅供参考，仅供用户学习参考，不能作为单一依据，建议网友根据实际情况结合信息内容，选择性采纳使用。
  7.7 任何由于不正当网络攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常经营的不可抗力而造成的用户个人资料泄露、丢失、被盗用或被窜改等，运营主体不承担任何责任。
  
### 8. 违约赔偿
  8.1 如因运营主体违反有关法律、法规或本协议项下的任何条款而给用户造成损失，运营主体同意承担由此造成的损害赔偿责任。
  8.2 用户同意保障和维护运营主体及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给运营主体或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。
  
### 9. 协议修改
  9.1 运营主体有权随时修改本协议的任何条款，一旦本协议的内容发生变动，运营主体将会直接在运营主体网站上公布修改之后的协议内容，该公布行为视为运营主体已经通知用户修改内容。运营主体也可通过其他适当方式向用户提示修改内容。
  9.2 如果不同意运营主体对本协议相关条款所做的修改，用户有权停止使用网络服务，在此情况下，运营主体没有义务传送任何未处理的信息或未完成的服务给用户或任何无直接关联的第三方。如果用户继续使用网络服务，则视为用户接受运营主体对本协议相关条款所做的修改。
  
###  10. 未成年人使用提示
  10.1 若用户未满18周岁则为未成年人，未成年人用户应在监护人的监护、指导下阅读本协议和使用帕拉卡（Paracraft）产品服务。
  10.2 未成年人用户在使用本服务时应注意以下事项，提高安全意识，加强自我保护：
  (1)填写个人资料时，加强个人保护意识，请勿直接在用户名、个人简介等自定义内容填写敏感信息；
  (2) 在监护人或教师的指导下，学习正确使用网络；
  (3) 避免陌生网友随意会面或参与联谊活动，以免不法分子有机可乘，危及自身安全。
  10.3 未成年人在无监护人监护、指导或监护人未尽到监护、指导义务的情况下，自行阅读本协议和使用本服务，由此对未成年人本人或其家庭或他人或运营主体提带来的不利后果或损失，均由该未成年人及其家长或监护人承担，运营主体不对未成年人该行为产生的后果或损失承担任何责任。
  
### 11. 通知送达
  11.1 本协议项下运营主体对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
  11.2 用户对于运营主体的通知应当通过运营主体对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。

###  12. 法律管辖
  12.1 本协议的成立、、生效、履行和解释及争议的解决均应适用中华人民共和国法律。
  12.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向运营主体所在地的人民法院提起诉讼。
  
###  13. 其他规定
  13.1 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。
  13.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
  13.3 本协议中的标题仅为方便而设，在解释本协议时应被忽略。
  13.4 本协议解释权和修订权归运营主体所有。
]]

local UserProtocolConfig = NPL.export()

function UserProtocolConfig:GetUserPrivacy()
    local appName = "Paracraft(帕拉卡)"
    if System.options.appName and System.options.appName~= "" then
        appName = System.options.appName
    end
    local privacyStr = string.gsub(privacyStr, "<appname>" ,appName)
    return privacyStr
end

function UserProtocolConfig:GetUserLicense()
    return licenseStr
end
